app/controllers/shortened_urls_controller.rb

INSERT INTO "shorten_urls" ("base_original_url", "minimized_url", "clean_url", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?)  [["base_original_url", "adsasd3er"], ["minimized_url", "xxx"], ["clean_url", "adsasd3er"], ["created_at", "2018-11-27 17:12:06.047505"], ["updated_at", "2018-11-27 17:12:06.047505"]]
---
	def create
		@domain = request.protocol+request.host_with_port
		@url = ShortenUrl.new
		@url.base_original_url = params[:base_original_url]
		@url.sanitize

		respond_to do |format|
			if @url.new_url?
				if @url.save

SELECT  "shorten_urls".* FROM "shorten_urls" WHERE "shorten_urls"."minimized_url" = ? LIMIT ?  [["minimized_url", "xxx"], ["LIMIT", 1]]
---
	def shortened
		@url = ShortenUrl.find_by_minimized_url(params[:minimized_url])

SELECT  "shorten_urls".* FROM "shorten_urls" WHERE "shorten_urls"."minimized_url" = ? LIMIT ?  [["minimized_url", "xxx"], ["LIMIT", 1]]
---
	def find_url
		@url = ShortenUrl.find_by_minimized_url(params[:minimized_url])