app/models/shorten_url.rb

SELECT  "shorten_urls".* FROM "shorten_urls" WHERE "shorten_urls"."clean_url" = ? LIMIT ?  [["clean_url", "google.com"], ["LIMIT", 1]]
---
	def find_duplicate
		ShortenUrl.find_by_clean_url(self.clean_url)